Q1. List any five functions of the pandas library with execution.

    1. read_csv: This function is used to read a CSV file to pandas DataFrame format. 
        df = pd.read_csv("File_name.csv")
    2. head : This function is used to display number of 1st five rows by default. We can also 
        give argument (n) i.e, number of rows to be displayed.
        df.head() or df.head(n)
    3. shape : This function is used to count the rows and columns in DataFrame. It returns the 
        no. of rows and columns enclosed in a tuple.
        df.shape
    4. describe : This function is used to know the summary of Statistics of DataFrame.
        df.describe()
    5. sort_values : This function is used for sorting the DataFrame.
        df.sort_values(by=['Age'], ascending=True) where Age is column name

Execution of above functions of pandas library are:

In [1]:
# Creating a csv file
import csv
data = [
    ['Name', 'Age', 'City', 'State', 'Gender', 'Salary'],
    ['Alam',29,	'Indore', 'Madhya Pradesh',	'Male',	50000],
    ['Rohit', 23, 'New Delhi', 'Delhi', 'Male', 85000],
    ['Bimla', 35, 'Rohtak', 'Haryana', 'Female', 20000],
    ['Rahul', 25, 'Kolkata', 'West bengal', 'Male', 40000],
    ['Chaman', 32, 'Chennai', 'Tamil Nadu', 'Male', 65000],
    ['Ruhi', 38, 'Gurugram', 'Haryana', 'Female', 60000]
]
with open('data.csv', 'w') as f:
    writer = csv.writer(f)

    for i in data:
        writer.writerow(i)

In [2]:
# Execution of function read_csv file
import pandas as pd
pd.read_csv('data.csv')

     Name  Age       City           State  Gender  Salary
0    Alam   29     Indore  Madhya Pradesh    Male   50000
1   Rohit   23  New Delhi           Delhi    Male   85000
2   Bimla   35     Rohtak         Haryana  Female   20000
3   Rahul   25    Kolkata     West bengal    Male   40000
4  Chaman   32    Chennai      Tamil Nadu    Male   65000
5    Ruhi   38   Gurugram         Haryana  Female   60000

In [3]:
# Execution of head() function
df = pd.read_csv('data.csv')
df.head(3)

    Name  Age       City           State  Gender  Salary
0   Alam   29     Indore  Madhya Pradesh    Male   50000
1  Rohit   23  New Delhi           Delhi    Male   85000
2  Bimla   35     Rohtak         Haryana  Female   20000

In [4]:
# Execution of shape function
df.shape

(6, 6)

In [5]:
# Execution of describe() function
df.describe()

             Age        Salary
count   6.000000      6.000000
mean   30.333333  53333.333333
std     5.785038  22286.019534
min    23.000000  20000.000000
25%    26.000000  42500.000000
50%    30.500000  55000.000000
75%    34.250000  63750.000000
max    38.000000  85000.000000

In [6]:
# Execution of sort_values() function.
df.sort_values('Salary')

     Name  Age       City           State  Gender  Salary
2   Bimla   35     Rohtak         Haryana  Female   20000
3   Rahul   25    Kolkata     West bengal    Male   40000
0    Alam   29     Indore  Madhya Pradesh    Male   50000
5    Ruhi   38   Gurugram         Haryana  Female   60000
4  Chaman   32    Chennai      Tamil Nadu    Male   65000
1   Rohit   23  New Delhi           Delhi    Male   85000

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [7]:
import pandas as pd
import numpy as np
column = ['A', 'B', 'C']
df = pd.DataFrame(np.random.rand(3, 3), columns=column)
new_index = list(range(1, 6, 2))
df.reindex(new_index)

         A         B         C
1  0.59464  0.038387  0.033447
3      NaN       NaN       NaN
5      NaN       NaN       NaN

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [8]:
import pandas as pd
data = {'Values': [10, 20, 30, 40, 50]}
df = pd.DataFrame(data)
sum = 0
for i in df['Values'][0:3]:
    sum += i
print(sum)

60

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [9]:
import pandas as pd
data = {'Text': ['Data Science', 'Data Scientist', 'Python','Statics', 'Machine Learning']}
df = pd.DataFrame(data)
f = lambda x:len(x['Text'].split())
df['Word_Count'] = df.apply(f, axis=1)
df

               Text  Word_Count
0      Data Science           2
1    Data Scientist           2
2            Python           1
3           Statics           1
4  Machine Learning           2

Q5. How are DataFrame.size() and DataFrame.shape() different?

    dataFrame.size: Returns size of DataFrame/Series which is equivalent to total number of
        elements in DataFrame. That is rows x columns.

    dataFrame.shape: Return a tuple representing the dimensionality of the DataFrame/Series

In [10]:
# size and shape of dataframe of Q4
print(df.size)
print(df.shape)

10
(5, 2)

Q6. Which function of pandas do we use to read an excel file?

    read_excel() function is used to read an excel file in pandas.

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the
email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
function should extract the username from each email address and store it in the new 'Username'
column.

In [11]:
import pandas as pd

def user_name(s):
    user = ''
    for i in s:
        if(i == '@'):
            break
        user += i
    return user

data = {'Email': ['rakhi123@gmail.com', 'ritika34@gmail.com', 'smriti45@gmail.com']}
df = pd.DataFrame(data)
f = lambda x: user_name(x['Email'])
df['Username'] = df.apply(f, axis=1)
df

                Email  Username
0  rakhi123@gmail.com  rakhi123
1  ritika34@gmail.com  ritika34
2  smriti45@gmail.com  smriti45

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

    For example, if df contains the following values:
      A B C
    0 3 5 1
    1 8 2 7
    2 6 9 4
    3 2 3 5
    4 9 1 2

In [12]:
import pandas as pd
data = {
    'A':[3, 8, 6, 2, 9],
    'B':[5, 2, 9, 3, 1],
    'C':[1, 7, 4, 5, 2]
}
df = pd.DataFrame(data)

def fun(df):
    df1 = df[(df['A'] > 5) & (df['B'] < 10)]
    return df1

df2 = fun(df)
df2

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2